# Start

In [1]:
source_folder = "../test/"

loan_details_file = f"{source_folder}loan_details.xlsx"
geo_file = f"{source_folder}geographic_data.xml"
financial_file = f"{source_folder}financial_ratios.jsonl"
demographic_file = f"{source_folder}demographics.csv"
history_file = f"{source_folder}credit_history.parquet"
app_file = f"{source_folder}application_metadata.csv"

output_file = "../results.csv"

In [2]:
import pandas as pd

In [3]:
loan_details=pd.read_excel(loan_details_file)
loan_details['loan_amount']=loan_details['loan_amount'].replace('[\$,]', '', regex=True).astype(float)
loan_details.head()

,customer_id,loan_type,loan_amount,loan_term,interest_rate,loan_purpose,loan_to_value_ratio,origination_channel,loan_officer_id,marketing_campaign
0,100000,Personal,11300.0,24,10.26,Debt Consolidation,0.000,Online,1066,T
1,100001,CC,6800.0,0,17.74,Revolving Credit,0.000,Branch,1041,B
2,100002,credit card,3400.0,0,19.42,Revolving Credit,0.000,Online,1001,W
3,100003,CC,12000.0,0,20.95,Revolving Credit,0.000,Online,1098,D
4,100004,MORTGAGE,279900.0,360,6.99,Refinance,0.798,Online,1067,H

In [4]:
loan_details.isna().sum()

customer_id            0
loan_type              0
loan_amount            0
loan_term              0
interest_rate          0
loan_purpose           0
loan_to_value_ratio    0
origination_channel    0
loan_officer_id        0
marketing_campaign     0
dtype: int64

In [5]:
loan_map = {
    'cc': 'Credit Card',
    'credit card': 'Credit Card',
    'creditcard': 'Credit Card',
    'home loan': 'Mortgage',
    'mortgage': 'Mortgage',
    'personal': 'Personal Loan',
    'personal loan': 'Personal Loan'
}
loan_details['loan_type'] = loan_details['loan_type'].str.lower().map(lambda x: loan_map.get(x, x))
print(loan_details)

       customer_id      loan_type  loan_amount  loan_term  interest_rate  \
0           100000  Personal Loan      11300.0         24          10.26
1           100001    Credit Card       6800.0          0          17.74
2           100002    Credit Card       3400.0          0          19.42
3           100003    Credit Card      12000.0          0          20.95
4           100004       Mortgage     279900.0        360           6.99
...            ...            ...          ...        ...            ...
9996        109996       Mortgage     275000.0        360           5.72
9997        109997  Personal Loan       8200.0         24          10.36
9998        109998  Personal Loan      17700.0         48          11.59
9999        109999  Personal Loan      19900.0         60          12.94
10000       110000  Personal Loan      22800.0         24          12.32

             loan_purpose  loan_to_value_ratio origination_channel  \
0      Debt Consolidation                0.000              Online
1        Revolving Credit                0.000              Branch
2        Revolving Credit                0.000              Online
3        Revolving Credit                0.000              Online
4               Refinance                0.798              Online
...                   ...                  ...                 ...
9996            Refinance                0.844              Broker
9997       Major Purchase                0.000              Branch
9998       Major Purchase                0.000              Branch
9999              Medical                0.000              Branch
10000    Home Improvement                0.000              Online

       loan_officer_id marketing_campaign
0                 1066                  T
1                 1041                  B
2                 1001                  W
3                 1098                  D
4                 1067                  H
...                ...                ...
9996              1015                  L
9997              1000                  E
9998              1011                  F
9999              1068                  O
10000             1011                  Z

[10001 rows x 10 columns]

In [6]:
demografics=pd.read_csv(demographic_file)
demografics['annual_income']=demografics['annual_income'].replace('[\$,]', '', regex=True).astype(float)
demografics.head()

,cust_id,age,annual_income,employment_length,employment_type,education,marital_status,num_dependents
0,100000,57,52300.0,11.7,Self Employed,Some College,Divorced,0
1,100001,41,45700.0,5.5,SELF_EMPLOYED,High School,Married,1
2,100002,22,20000.0,4.4,Part Time,Graduate,Single,1
3,100003,27,44300.0,8.0,FULL_TIME,High School,Single,1
4,100004,32,41100.0,0.9,FT,Bachelor,Single,3

In [7]:
demografics.isna().sum()

cust_id                0
age                    0
annual_income          0
employment_length    247
employment_type        0
education              0
marital_status         0
num_dependents         0
dtype: int64

In [8]:
demografics['employment_length'] = demografics['employment_length'].fillna(0)

In [9]:
demografics.isna().sum()

cust_id              0
age                  0
annual_income        0
employment_length    0
employment_type      0
education            0
marital_status       0
num_dependents       0
dtype: int64

In [10]:
standardized_job_types = {
    'contract': 'contract',
    'contractor': 'contract',
    'ft': 'full_time',
    'full_time': 'full_time',
    'full time': 'full_time',
    'full-time': 'full_time',
    'fulltime': 'full_time',
    'pt': 'part_time',
    'part_time': 'part_time',
    'part time': 'part_time',
    'part-time': 'part_time',
    'self_employed': 'self_employed',
    'self emp': 'self_employed',
    'self employed': 'self_employed',
    'self-employed': 'self_employed'
}

# Normalizatsiya
demografics['employment_type'] = demografics['employment_type'].str.lower().map(lambda x: standardized_job_types.get(x, x))

demografics.head()

,cust_id,age,annual_income,employment_length,employment_type,education,marital_status,num_dependents
0,100000,57,52300.0,11.7,self_employed,Some College,Divorced,0
1,100001,41,45700.0,5.5,self_employed,High School,Married,1
2,100002,22,20000.0,4.4,part_time,Graduate,Single,1
3,100003,27,44300.0,8.0,full_time,High School,Single,1
4,100004,32,41100.0,0.9,full_time,Bachelor,Single,3

In [11]:
geopgrafics_data = pd.read_xml(geo_file)
geopgrafics_data.head()

,id,state,regional_unemployment_rate,regional_median_income,regional_median_rent,housing_price_index,cost_of_living_index,previous_zip_code
0,100000,TN,4.1,53000,1400.0,99.0,73.0,390
1,100001,CA,5.6,75000,1580.0,161.0,130.0,292
2,100002,NY,4.9,72000,1740.0,138.0,118.0,552
3,100003,MA,4.0,81000,1770.0,140.0,116.0,716
4,100004,IL,4.8,65000,1520.0,96.0,86.0,559

In [12]:
geopgrafics_data.isna().sum()

id                            0
state                         0
regional_unemployment_rate    0
regional_median_income        0
regional_median_rent          0
housing_price_index           0
cost_of_living_index          0
previous_zip_code             0
dtype: int64

In [13]:
credit_history=pd.read_parquet(history_file)
credit_history.head()

,customer_number,credit_score,num_credit_accounts,oldest_credit_line_age,oldest_account_age_months,total_credit_limit,num_delinquencies_2yrs,num_inquiries_6mo,recent_inquiry_count,num_public_records,num_collections,account_diversity_index
0,100000,770,8,1.5,18.0,140600.0,0.0,1,1,0,0,0.250
1,100001,733,7,14.6,175.2,90400.0,0.0,1,1,0,0,0.284
2,100002,660,0,4.0,48.0,32400.0,0.0,5,5,0,1,0.050
3,100003,605,14,9.0,108.0,39100.0,NaN,0,0,0,0,0.347
4,100004,721,5,8.7,104.4,47900.0,0.0,2,2,1,0,0.239

In [14]:
selected_credit_history_columns = [
    "customer_number",
    "num_credit_accounts", 
    "oldest_credit_line_age",
    "oldest_account_age_months",
    "total_credit_limit",
    "num_delinquencies_2yrs", 
    "num_inquiries_6mo",
    "recent_inquiry_count", 
    "num_public_records",
    "num_collections",
    "account_diversity_index"
]
credit_history = credit_history[selected_credit_history_columns]

In [15]:
credit_history.isna().sum()

customer_number                0
num_credit_accounts            0
oldest_credit_line_age         0
oldest_account_age_months      0
total_credit_limit             0
num_delinquencies_2yrs       114
num_inquiries_6mo              0
recent_inquiry_count           0
num_public_records             0
num_collections                0
account_diversity_index        0
dtype: int64

In [16]:
credit_history['num_delinquencies_2yrs'] = credit_history['num_delinquencies_2yrs'].fillna(0)

In [17]:
credit_history.isna().sum()

customer_number              0
num_credit_accounts          0
oldest_credit_line_age       0
oldest_account_age_months    0
total_credit_limit           0
num_delinquencies_2yrs       0
num_inquiries_6mo            0
recent_inquiry_count         0
num_public_records           0
num_collections              0
account_diversity_index      0
dtype: int64

# Financial Ratios

In [18]:
finance_ratios=pd.read_json(financial_file, lines=True)
finance_ratios.head()

,cust_num,monthly_income,existing_monthly_debt,monthly_payment,debt_to_income_ratio,debt_service_ratio,payment_to_income_ratio,credit_utilization,revolving_balance,credit_usage_amount,available_credit,total_monthly_debt_payment,annual_debt_payment,loan_to_annual_income,total_debt_amount,monthly_free_cash_flow
0,100000,$4358,"$1,024.36",522.79,0.355,0.354987,0.120,0.354,"$49,772.40","49,772.40","$90,827.60",1547.1499999999999,18565.80,0.216061,"$61,072.40","2,811.18"
1,100001,"3,808.33","$1,206.09",$204.00,0.370,0.370264,0.054,0.282,"25,492.80","$25,492.80","$64,907.20",1410.09,16921.08,0.148796,"$32,292.80","$2,398.24"
2,100002,"1,666.67",$259.53,102.00,0.217,0.216918,0.061,0.377,12214.8,"12,214.80","$20,185.20",361.53,4338.36,0.170000,"15,614.80","1,305.14"
3,100003,"3,691.67","1,117.20",360.0,0.400,0.400144,0.098,0.365,"14,271.50","14,271.50","$24,828.50","1,477.20",17726.40,0.270880,"26,271.50","2,214.47"
4,100004,"$3,425.00",$712.04,"$1,860.30",0.751,0.751048,0.543,0.490,"$23,471.00","$23,471.00","$24,429.00","2,572.34",30868.08,6.810219,303371.0,$852.66

In [19]:
finance_ratios = finance_ratios.drop(columns=["debt_to_income_ratio", "revolving_balance"])

for col in finance_ratios.columns:
    finance_ratios[col] = (
        finance_ratios[col]
        .astype(str)
        .str.replace(r"[$,]", "", regex=True)
        .replace("nan", pd.NA)
        .astype(float)
    )

In [20]:
app_data= pd.read_csv(app_file)
app_data = app_data.drop(columns=['random_noise_1', 'application_id'], errors='ignore')
app_data.head()

,customer_ref,application_hour,application_day_of_week,account_open_year,preferred_contact,referral_code,account_status_code,num_login_sessions,num_customer_service_calls,has_mobile_app,paperless_billing
0,100000,21,0,2018,Email,REF0000,ACT-1,12,2,0,0
1,100001,9,6,2021,Phone,REF0000,ACT-1,10,4,0,1
2,100002,10,4,2019,Phone,REF0000,ACT-1,4,3,1,1
3,100003,3,4,2011,Email,REF0000,ACT-2,7,0,1,0
4,100004,9,1,2021,Email,REF0000,ACT-1,6,0,1,0

## Encoding character columns

In [21]:
from sklearn.preprocessing import LabelEncoder

### App-Data

In [22]:
CURRENT_YEAR = 2025
app_data['account_tenure'] = CURRENT_YEAR - app_data['account_open_year']
app_data = app_data.drop(columns=['account_open_year'])

app_data['is_referred'] = (app_data['referral_code'] != 'REF0000').astype(int)
app_data = app_data.drop(columns=['referral_code'])

app_data['preferred_contact'] = app_data['preferred_contact'].replace({'Mail': 'Email'})
app_data['preferred_contact'] = app_data['preferred_contact'].map({'Email': 1, 'Phone': 0})

status_default_rate = app_data.groupby('account_status_code').mean().sort_values(by='account_status_code')
status_mapping = {status: idx for idx, status in enumerate(status_default_rate.index)}
app_data['account_status_code'] = app_data['account_status_code'].map(status_mapping)
app_data.head()

,customer_ref,application_hour,application_day_of_week,preferred_contact,account_status_code,num_login_sessions,num_customer_service_calls,has_mobile_app,paperless_billing,account_tenure,is_referred
0,100000,21,0,1,1,12,2,0,0,7,0
1,100001,9,6,0,1,10,4,0,1,4,0
2,100002,10,4,0,1,4,3,1,1,6,0
3,100003,3,4,1,2,7,0,1,0,14,0
4,100004,9,1,1,1,6,0,1,0,4,0

### Demographics

In [23]:

demografics_label_encoders = {}  
demografics_label_columns=['employment_type', 'education', 'marital_status']
for col in demografics_label_columns:
    le = LabelEncoder()
    demografics[col] = le.fit_transform(demografics[col])
    demografics_label_encoders[col] = le

In [24]:
demografics.head()

,cust_id,age,annual_income,employment_length,employment_type,education,marital_status,num_dependents
0,100000,57,52300.0,11.7,3,4,0,0
1,100001,41,45700.0,5.5,3,3,1,1
2,100002,22,20000.0,4.4,2,2,2,1
3,100003,27,44300.0,8.0,1,3,2,1
4,100004,32,41100.0,0.9,1,1,2,3

### geographics

In [25]:
geographics_label_encoder=LabelEncoder()
geopgrafics_data['state']=geographics_label_encoder.fit_transform(geopgrafics_data['state'])
geopgrafics_data.head()

,id,state,regional_unemployment_rate,regional_median_income,regional_median_rent,housing_price_index,cost_of_living_index,previous_zip_code
0,100000,15,4.1,53000,1400.0,99.0,73.0,390
1,100001,1,5.6,75000,1580.0,161.0,130.0,292
2,100002,12,4.9,72000,1740.0,138.0,118.0,552
3,100003,6,4.0,81000,1770.0,140.0,116.0,716
4,100004,4,4.8,65000,1520.0,96.0,86.0,559

### Loan details

In [26]:
loan_label_encoders = {}  
loan_label_columns=['loan_type', 'loan_purpose', 'origination_channel','marketing_campaign']
for col in loan_label_columns:
    le = LabelEncoder()
    loan_details[col] = le.fit_transform(loan_details[col])
    loan_label_encoders[col] = le 
loan_details.head()

,customer_id,loan_type,loan_amount,loan_term,interest_rate,loan_purpose,loan_to_value_ratio,origination_channel,loan_officer_id,marketing_campaign
0,100000,2,11300.0,24,10.26,0,0.000,3,1066,19
1,100001,0,6800.0,0,17.74,7,0.000,0,1041,1
2,100002,0,3400.0,0,19.42,7,0.000,3,1001,22
3,100003,0,12000.0,0,20.95,7,0.000,3,1098,3
4,100004,1,279900.0,360,6.99,6,0.798,3,1067,7

### training model

In [27]:
final_df = loan_details.merge(demografics, left_on='customer_id', right_on="cust_id", how='outer').merge(geopgrafics_data,left_on="customer_id",right_on="id", how='outer').merge(credit_history,left_on="customer_id",right_on="customer_number",how="outer")
final_df=final_df.merge(app_data,left_on="customer_id",right_on="customer_ref",how="outer").merge(finance_ratios,left_on="customer_id",right_on="cust_num",how="outer")
final_df.columns

Index(['customer_id', 'loan_type', 'loan_amount', 'loan_term', 'interest_rate',
       'loan_purpose', 'loan_to_value_ratio', 'origination_channel',
       'loan_officer_id', 'marketing_campaign', 'cust_id', 'age',
       'annual_income', 'employment_length', 'employment_type', 'education',
       'marital_status', 'num_dependents', 'id', 'state',
       'regional_unemployment_rate', 'regional_median_income',
       'regional_median_rent', 'housing_price_index', 'cost_of_living_index',
       'previous_zip_code', 'customer_number', 'num_credit_accounts',
       'oldest_credit_line_age', 'oldest_account_age_months',
       'total_credit_limit', 'num_delinquencies_2yrs', 'num_inquiries_6mo',
       'recent_inquiry_count', 'num_public_records', 'num_collections',
       'account_diversity_index', 'customer_ref', 'application_hour',
       'application_day_of_week', 'preferred_contact', 'account_status_code',
       'num_login_sessions', 'num_customer_service_calls', 'has_mobile_app',
       'paperless_billing', 'account_tenure', 'is_referred', 'cust_num',
       'monthly_income', 'existing_monthly_debt', 'monthly_payment',
       'debt_service_ratio', 'payment_to_income_ratio', 'credit_utilization',
       'credit_usage_amount', 'available_credit', 'total_monthly_debt_payment',
       'annual_debt_payment', 'loan_to_annual_income', 'total_debt_amount',
       'monthly_free_cash_flow'],
      dtype='object')

In [28]:
X = final_df.drop([
     'cust_id', 'id','customer_number','customer_ref',
     'cust_num','previous_zip_code','state',
     'marketing_campaign','loan_officer_id','num_login_sessions',
     'application_hour','total_monthly_debt_payment','credit_usage_amount','num_credit_accounts',
     'oldest_account_age_months','cost_of_living_index','total_monthly_debt_payment',
     'application_day_of_week','has_mobile_app','preferred_contact','is_referred','account_status_code'
                   ], axis=1)

In [29]:
X.to_csv("../test/merged_x.csv",index=False)